# Data Frame - Two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes
Arithmetic operations align on both row and column labels. 

Can be thought of as a dict-like container for Series objects. 

The primary pandas data structure.

In [3]:
import pandas as pd
import numpy as np

In [88]:
# create a dictionary
dict1 ={'Brand':['Pepsi','Coke','Nike','Pepsi'], 
        'Product':['Diet Pepsi 12oz.', 'Coke lemon Flavor 16oz.', 'Nike cool running shoes', 'Pepsi 16oz']}

In [99]:
# create a DataFrame from a dictionary
productDeatils =pd.DataFrame(dict1)
productDeatils

   Brand                  Product
0  Pepsi         Diet Pepsi 12oz.
1   Coke  Coke lemon Flavor 16oz.
2   Nike  Nike cool running shoes
3  Pepsi               Pepsi 16oz

In [59]:
# creating a dataframe from a List
names =[['Jack',12],['John', 24],['Jill',30], ['Anny',5]]
names_frame = pd.DataFrame(names)
names_frame

      0   1
0  Jack  12
1  John  24
2  Jill  30
3  Anny   5

In [71]:
#creating dataframe from ndarray
import numpy as np
data = np.array([['', 'State', 'Capital'], 
                 ['state1', 'Iowa', 'Demoines'], 
                 ['state2', 'California', 'Sacramento'],
                 ['state3', 'Ohio','Columbus',],
                 ['state4', 'Alabama', 'Montgomery'],
                 ['state5', 'New York', 'Albany'],
                 ['state6','Florida', 'Tallahassee'],
                 ['state7','Kansas','Topeka']
                ])
# data starts row 1 and col1  column is row 0 col 1 till end  Index starts from row till end and column 0
state = pd.DataFrame(data= data[1:,1:], columns=data[0,1:], index= data[1:,0])  
state

             State      Capital
state1        Iowa     Demoines
state2  California   Sacramento
state3        Ohio     Columbus
state4     Alabama   Montgomery
state5    New York       Albany
state6     Florida  Tallahassee
state7      Kansas       Topeka

In [17]:
#understanding difference between loc and iloc
#iloc is integer  based selection
# here we will select row 2, col 1 from state dataFrame - we want to select California
# remember in Python Index start at 0
print(state.iloc[1,0])

# using loc based on index of the DataFrame
print(state.loc['state2','State'])

California
California

In [73]:
# selecting a range of values from row 3 to 5
state.iloc[2:5]

           State     Capital
state3      Ohio    Columbus
state4   Alabama  Montgomery
state5  New York      Albany

In [80]:
state.iloc[1:3, 1]

state2    Sacramento
state3      Columbus
Name: Capital, dtype: object

In [100]:
# Adding a column to a DataFrame
Sales_in_million =[1, 1.5, 2,6]
productDeatils['Sales'] = Sales_in_million
productDeatils

   Brand                  Product  Sales
0  Pepsi         Diet Pepsi 12oz.    1.0
1   Coke  Coke lemon Flavor 16oz.    1.5
2   Nike  Nike cool running shoes    2.0
3  Pepsi               Pepsi 16oz    6.0

In [101]:
#Adding rows  to dataframe
df_row = pd.DataFrame([['Disney',' Frozen Princess Alsa', 3],
                       ['Apple', 'Iphone7', 50]], 
                      columns=['Brand','Product','Sales'])
productDeatils = productDeatils.append(df_row)
productDeatils

    Brand                  Product  Sales
0   Pepsi         Diet Pepsi 12oz.    1.0
1    Coke  Coke lemon Flavor 16oz.    1.5
2    Nike  Nike cool running shoes    2.0
3   Pepsi               Pepsi 16oz    6.0
0  Disney     Frozen Princess Alsa    3.0
1   Apple                  Iphone7   50.0

In [46]:
# deleting a column in dataframe using del
del productDeatils['Brand']

In [35]:
productDeatils

                   Product  Sales
0         Diet Pepsi 12oz.    1.0
1  Coke lemon Flavor 16oz.    1.5
2  Nike cool running shoes    2.0
3               Pepsi 16oz    6.0

In [44]:
# deleting a column in dataframe using drop - axis =1 is for column and inplace = True means we do not need to reassign it back to datafreame
productDeatils.drop('Sales',axis=1, inplace =True)

In [47]:
productDeatils

                   Product
0         Diet Pepsi 12oz.
1  Coke lemon Flavor 16oz.
2  Nike cool running shoes
3               Pepsi 16oz

In [49]:
# deleting a column in dataframe using pop
productDeatils.pop('Product')

0           Diet Pepsi 12oz.
1    Coke lemon Flavor 16oz.
2    Nike cool running shoes
3                 Pepsi 16oz
Name: Product, dtype: object

In [50]:
productDeatils

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [68]:
#Dropping a row in dataframe
data_1 = {'Name':['Amy', ' Anu', ' David', 'Tom'],
         'Reports':[12,3,14,12],
         'Hobby':['Reading', 'Singing', 'Travelling', ' Technology']}
hobby = pd.DataFrame(data_1, index =['Person1', 'Person2', 'Person3', 'Person4'])
hobby

               Hobby    Name  Reports
Person1      Reading     Amy       12
Person2      Singing     Anu        3
Person3   Travelling   David       14
Person4   Technology     Tom       12

In [69]:
# deleteing person2 with inplace =False and no reassignment
hobby.drop(["Person2"], axis=0, inplace=False)
hobby

               Hobby    Name  Reports
Person1      Reading     Amy       12
Person2      Singing     Anu        3
Person3   Travelling   David       14
Person4   Technology     Tom       12

In [70]:
# deleteing person2 with inplace =False and  reassignment
hobby = hobby.drop(["Person2"], axis=0, inplace=False)
hobby

               Hobby    Name  Reports
Person1      Reading     Amy       12
Person3   Travelling   David       14
Person4   Technology     Tom       12

In [60]:
#renaming a column
names_frame.rename(columns={0:'Name', 1:'Age'}, inplace=True)
names_frame

   Name  Age
0  Jack   12
1  John   24
2  Jill   30
3  Anny    5

In [61]:
#renaming a Index
names_frame.rename(index={0:'Jack Details'}, inplace=True)
names_frame

              Name  Age
Jack Details  Jack   12
1             John   24
2             Jill   30
3             Anny    5

In [102]:
grp_data = productDeatils.groupby('Brand').count()
grp_data

        Product  Sales
Brand
Apple         1      1
Coke          1      1
Disney        1      1
Nike          1      1
Pepsi         2      2

In [103]:
grp_sales = productDeatils.groupby('Brand').sum()
grp_sales

        Sales
Brand
Apple    50.0
Coke      1.5
Disney    3.0
Nike      2.0
Pepsi     7.0

In [104]:
grp_max = productDeatils.groupby('Brand').max()
grp_max

                        Product  Sales
Brand
Apple                   Iphone7   50.0
Coke    Coke lemon Flavor 16oz.    1.5
Disney     Frozen Princess Alsa    3.0
Nike    Nike cool running shoes    2.0
Pepsi                Pepsi 16oz    6.0

In [117]:
productDeatils.sort_values('Brand',ascending=True) # sort by Product count

    Brand                  Product  Sales
1   Apple                  Iphone7   50.0
1    Coke  Coke lemon Flavor 16oz.    1.5
0  Disney     Frozen Princess Alsa    3.0
2    Nike  Nike cool running shoes    2.0
0   Pepsi         Diet Pepsi 12oz.    1.0
3   Pepsi               Pepsi 16oz    6.0

In [113]:
productDeatils.sort_values(['Sales','Brand'], ascending=False) # sort by Product from highest to lowest

    Brand                  Product  Sales
1   Apple                  Iphone7   50.0
3   Pepsi               Pepsi 16oz    6.0
0  Disney     Frozen Princess Alsa    3.0
2    Nike  Nike cool running shoes    2.0
1    Coke  Coke lemon Flavor 16oz.    1.5
0   Pepsi         Diet Pepsi 12oz.    1.0

In [118]:
sales_more_2M= productDeatils[productDeatils.Sales > 2] # gets sales >2M
sales_more_2M

    Brand                Product  Sales
3   Pepsi             Pepsi 16oz    6.0
0  Disney   Frozen Princess Alsa    3.0
1   Apple                Iphone7   50.0

In [122]:
pepsi_sales_more_2M= productDeatils[(productDeatils.Sales > 2) & 
                                    (productDeatils.Brand == 'Pepsi')] # gets sales >2M
pepsi_sales_more_2M

   Brand     Product  Sales
3  Pepsi  Pepsi 16oz    6.0

In [135]:
brand_product = productDeatils.iloc[:,:2]
for key,value in brand_product.iteritems():
    print( key, value)

Brand 0     Pepsi
1      Coke
2      Nike
3     Pepsi
0    Disney
1     Apple
Name: Brand, dtype: object
Product 0           Diet Pepsi 12oz.
1    Coke lemon Flavor 16oz.
2    Nike cool running shoes
3                 Pepsi 16oz
0       Frozen Princess Alsa
1                    Iphone7
Name: Product, dtype: object

In [139]:
for index, row in brand_product.iterrows():
    print(index, row)

0 Brand                 Pepsi
Product    Diet Pepsi 12oz.
Name: 0, dtype: object
1 Brand                         Coke
Product    Coke lemon Flavor 16oz.
Name: 1, dtype: object
2 Brand                         Nike
Product    Nike cool running shoes
Name: 2, dtype: object
3 Brand           Pepsi
Product    Pepsi 16oz
Name: 3, dtype: object
0 Brand                     Disney
Product     Frozen Princess Alsa
Name: 0, dtype: object
1 Brand        Apple
Product    Iphone7
Name: 1, dtype: object

In [140]:
for row in brand_product.itertuples():
    print(row)

Pandas(Index=0, Brand='Pepsi', Product='Diet Pepsi 12oz.')
Pandas(Index=1, Brand='Coke', Product='Coke lemon Flavor 16oz.')
Pandas(Index=2, Brand='Nike', Product='Nike cool running shoes')
Pandas(Index=3, Brand='Pepsi', Product='Pepsi 16oz')
Pandas(Index=0, Brand='Disney', Product=' Frozen Princess Alsa')
Pandas(Index=1, Brand='Apple', Product='Iphone7')

In [145]:
data={"Brand": ['Brand1', 'Brand2', 'Brand1', 'Brand3'],
     "cust_cat":['Platinum', 'Bronze', 'Gold', 'Gold'],
     'USD': [100, 30, 70, 190]}

In [147]:
df1 = pd.DataFrame(data)
df1

    Brand  USD  cust_cat
0  Brand1  100  Platinum
1  Brand2   30    Bronze
2  Brand1   70      Gold
3  Brand3  190      Gold

In [150]:
df1.pivot(index ='Brand', columns="cust_cat")

            USD
cust_cat Bronze   Gold Platinum
Brand
Brand1      NaN   70.0    100.0
Brand2     30.0    NaN      NaN
Brand3      NaN  190.0      NaN